#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: logica0419, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113601976895]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113601976902]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113601976919]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113601976909]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113601976894]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113601976906]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113601976904]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113601976903]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113601976910]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113601976900]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113601976912]
data.sakuracloud_archive.ubuntu_archive: Read complete after 2s [id=113601947038]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113601976896]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113601976899]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113601976897]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113601976898]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113601976913]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113601976901]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113601976911]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113601976908]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113601976918]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113601976916]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113601976917]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113601976914]
sakuracloud_vpc_router.k8s_internal_router: Refreshing state... [id=113601976920]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113601976923]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113601976934]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113601976936]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113601976929]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113601976952]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113601976949]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113601976953]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113601976969]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113601976959]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113601976963]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113601976951]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113601976950]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=19954]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601976899" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113601976929" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601976897" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113601976934" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601976898" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113601976936" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                   = "113601976896" -> (known after apply)
        name                 = "k8s-dev-router-1"
      ~ server_id            = "113601976923" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976908" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113601976950" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976914" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113601976951" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976911" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113601976952" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976917" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113601976949" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976913" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113601976969" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976916" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113601976963" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976918" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113601976953" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976901" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113601976959" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601976899",
        ] -> (known after apply)
        id                = "113601976929"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601976897",
        ] -> (known after apply)
        id                = "113601976934"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601976898",
        ] -> (known after apply)
        id                = "113601976936"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks             = [
          - "113601976896",
        ] -> (known after apply)
        id                = "113601976923"
        name              = "k8s-dev-router-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976908",
          - "113601976900",
        ] -> (known after apply)
        id                = "113601976950"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976914",
          - "113601976906",
        ] -> (known after apply)
        id                = "113601976951"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976911",
          - "113601976909",
        ] -> (known after apply)
        id                = "113601976952"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976917",
          - "113601976912",
        ] -> (known after apply)
        id                = "113601976949"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976913",
          - "113601976919",
        ] -> (known after apply)
        id                = "113601976969"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976916",
          - "113601976894",
        ] -> (known after apply)
        id                = "113601976963"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976918",
          - "113601976910",
        ] -> (known after apply)
        id                = "113601976953"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976901",
          - "113601976904",
        ] -> (known after apply)
        id                = "113601976959"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 12 to add, 12 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>